app/controllers/contracts_controller.rb

SELECT * FROM "contracts"
---
  def index
    @contracts = Contract.all

SELECT * FROM "contracts" WHERE ("contracts"."id" = 1)
---
  def show
    @contract = Contract.find(params[:id])

SELECT * FROM "contracts" WHERE ("contracts"."id" = 1)
---
  def edit
    @contract = Contract.find(params[:id])

INSERT INTO "contracts" ("name", "created_at", "code", "ended_at", "project_id", "updated_at", "value", "description", "started_at", "status", "leader_id") VALUES('Elias Farah', '2010-04-08 22:35:05', '99uoioi', '2010-04-08 22:34:00', 1, '2010-04-08 22:35:05', 2000.0, 'teste', '2010-04-08 22:34:00', 'prospecting', 1)
---
  def create
    @contract = Contract.new(params[:contract])

    respond_to do |format|
      if @contract.save

SELECT * FROM "contracts" WHERE ("contracts"."id" = 1)
UPDATE "contracts" SET "updated_at" = '2010-04-08 22:36:09', "value" = 2000.399 WHERE "id" = 1
---
  def update
    @contract = Contract.find(params[:id])

    respond_to do |format|
      if @contract.update_attributes(params[:contract])

SELECT * FROM "contracts" WHERE ("contracts"."id" = 1)
DELETE FROM "contracts" WHERE "id" = 1
---
  def destroy
    @contract = Contract.find(params[:id])
    @contract.destroy

SELECT * FROM "projects"
SELECT * FROM "users"
---
  def load_data
    @projects = Project.all
    @users    = User.all