app/controllers/documents_controller.rb

SELECT * FROM "documents" WHERE ("documents"."id" = 1 AND ("documents".project_id = 1))
---
  def show
    @document = @project.documents.find(params[:id])

SELECT * FROM "documents" WHERE ("documents"."id" = 1 AND ("documents".project_id = 1))
---
  def edit
    @document = @project.documents.find(params[:id])

INSERT INTO "documents" ("created_at", "title", "document_file_size", "project_id", "updated_at", "document_file_name", "document_updated_at", "description", "document_content_type") VALUES('2010-04-09 10:46:32', 'Documento 1', 441956, 1, '2010-04-09 10:46:32', '05032009_003_.jpg', '2010-04-09 10:46:30', 'teste', 'image/jpeg')
---
  def create
    @document = @project.documents.build(params[:document])

    respond_to do |format|
      if @document.save

SELECT * FROM "documents" WHERE ("documents"."id" = 1 AND ("documents".project_id = 1))
UPDATE "documents" SET "document_content_type" = 'application/msword', "document_updated_at" = '2010-04-13 01:38:05', "updated_at" = '2010-04-13 01:38:05', "document_file_size" = 277504, "document_file_name" = 'Exemplo_Gauss.doc' WHERE "id" = 5
---
  def update
    @document = @project.documents.find(params[:id])

    respond_to do |format|
      if @document.update_attributes(params[:document])

SELECT * FROM "documents" WHERE ("documents"."id" = 1 AND ("documents".project_id = 1))
DELETE FROM "documents" WHERE "id" = 1
---
  def destroy
    @document = @project.documents.find(params[:id])
    @document.destroy

SELECT "documents".* FROM "documents" WHERE ("documents".project_id = 1)
SELECT * FROM "projects" WHERE ("projects"."id" = 1)
SELECT * FROM "projects"
---
  def load_data
    @project  = Project.find(params[:project_id], :include=>:documents)
    @projects = Project.all