app/controllers/home_controller.rb

  def finish
    @task = current_user.tasks.find(params[:id].gsub(/\D/,""))
    @task.update_attribute("status","closed")
---
SELECT * FROM "tasks" WHERE ("tasks"."id" = '--- !ruby/object:Enumerable::Enumerator {}
UPDATE "tasks" SET "updated_at" = '2010-04-11 01:18:48', "status" = 'closed' WHERE "id" = 4

  def save
    @task = current_user.tasks.build(params[:task].merge({:status=>"open"}))
    @task.save
---
INSERT INTO "tasks" ("created_at", "title", "ended_at", "project_id", "updated_at", "priority", "progress", "owner_id", "description", "started_at", "status") VALUES('2010-04-11 13:03:27', 'Nova tarefa', NULL, 3, '2010-04-11 13:03:27', 'normal', 7, 4, 'teste', '2010-04-11 13:01:00', 'open')