app/controllers/projects_controller.rb

SELECT * FROM "projects"
---
  def index
    @projects = Project.all(:include=>:customer)

INSERT INTO "projects" ("name", "created_at", "updated_at", "description", "customer_id", "active") VALUES('Fotolog', '2010-04-02 19:48:48', '2010-04-02 19:48:48', 'teste', 2, NULL)
---
  def create
    @project = Project.new(params[:project])

    respond_to do |format|
      if @project.save

SELECT * FROM "projects" WHERE ("projects"."id" = 1)
---
  def update
    @project = Project.find(params[:id])

SELECT * FROM "projects" WHERE ("projects"."id" = 1)
DELETE FROM "projects" WHERE "id" = 1
---
  def destroy
    @project = Project.find(params[:id])
    @project.destroy

SELECT * FROM "users"
SELECT * FROM "customers"
---
  def load_data
    @users = User.all
    @customers = Customer.all