app/controllers/tasks_controller.rb

  def index
    @tasks = Task.all
---
SELECT * FROM "tasks"

  def create
    @task = Task.new(params[:task])

    respond_to do |format|
      if @task.save
---
INSERT INTO "tasks" ("created_at", "title", "ended_at", "project_id", "updated_at", "priority", "progress", "owner_id", "description", "started_at", "status") VALUES('2010-04-02 20:12:34', 'terminar CRM', '2010-04-02 20:03:00', 1, '2010-04-02 20:12:34', 'normal', 1, 1, 'teste', '2010-04-02 20:03:00', 'open')

  def update
    @task = Task.find(params[:id])

    respond_to do |format|
      if @task.update_attributes(params[:task])
---
SELECT * FROM "tasks" WHERE ("tasks"."id" = 1)
UPDATE "tasks" SET "updated_at" = '2010-04-04 19:07:59', "started_at" = '2010-03-01 20:00:00', "progress" = 73, "ended_at" = '2010-04-15 21:00:00' WHERE "id" = 1

  def destroy
    @task = Task.find(params[:id])
    @task.destroy
---
SELECT * FROM "tasks" WHERE ("tasks"."id" = 1)
DELETE FROM "tasks" WHERE "id" = 1

  def load_data
    @users = User.all
    @projects = Project.all
---
SELECT * FROM "users" WHERE (LOWER("users".username) = 'elias_farah') LIMIT 1
SELECT * FROM "projects"