app/controllers/users_controller.rb

INSERT INTO "users" ("name", "kind", "created_at", "crypted_password", "updated_at", "username", "password_salt", "persistence_token", "email") VALUES('Elias Farah', 'administrator', '2010-04-10 00:00:12', '805105c22f95bdccd9c7b9ba5831b5bd2d0838b8da21e57494d65d57a9c14f1d6175bf74759482059427a36e87b0bbbf3ad790c302321312a2d351364afa3f3d', '2010-04-10 00:00:12', 'elias_farah', '0LSJ6X_H4_-ANU3JO4xa', '89e2af9f2224eafde6579c3ce9004fafd24c0c7ed381bac08660288c9247f6b582ee97cf6be1a75026dbd713952283f84888dcfaf6ae920c90dfc1f2c73ed026', 'eliasfa@gmail.com')
---
  def create
    @user = User.new(params[:user])

    if @user.save

UPDATE "users" SET "updated_at" = '2010-04-10 15:34:11', "email" = 'eliasfa@gmail.com' WHERE "id" = 4
---
  def update
    @user = current_user

    if @user.update_attributes(params[:user])